#----Messages----#
EMPTY_SYMBOL = '⠀'
#INFO
CART_IS_EMPTY = 'Ваша корзина пуста.'
GET_PHONE_NUMBER = 'Напишите свой номер телефона для подтверждения заказа\nПример: 79202213022'
OPERATOR_PROFILE = '💬 Для связи с оператором напишите ему в личные сообщения.\nПрофиль: https://vk.com/id774527659'
OPERATOR_PHONE = 'Номера операторов: \n📞+7(920)221-30-22\n📞+7(920)221-30-23'
HELLO = 'Приветствую, %s. Я бот пиццерии "Тесто есть".\nС моей помощью вы сможете сделать заказ.'

#ERRORS
DONT_UNDERSTAND = 'Извините, я вас не понял.\nВоспользуйтесь кнопками ниже👇'
USER_NOT_REGISTERED = 'Извините, вы не обнаружены в базе клиентов.\nВведите команду /start'
SOMETHING_WRONG = 'Упс, что-то пошло не так.\nПожалуйста, сообщите об этом нашему администратору: https://vk.com/id774527659'
CREATE_ORDER_ERROR = 'Не удалось создать заказ по техническим причинам.\nПожалуйста, сообщите об этом нашему администратору: https://vk.com/id774527659'
INCORRECT_PHONE_NUMBER = 'Указаный номер телефона некорректен, попробуйте снова...'

#SUCCESS
ORDER_CREATED = '🥳 Заказ создан, ожидайте звонка оператора'
CART_CLEARED = 'Корзина очищена'

#ACTIONS
GO_BACK = 'Назад'
START = '/start'
CANCEL_ORDER = '⛔ Отменяем заказ...\nВоспользуйтесь кнопками снова👇'

#NAVIGATION
OPERATOR_COMMUNICATION_MENU = "Меню оператора👇"
MAIN_MENU = 'Главное меню👇'
CART_MENU = 'Меню корзины👇'

#----Buttons----#
BACK_BTN = '👈 Назад'

#MENU
PRODUCT_MENU_BTN = '🍕 Наше меню'

#CART
CART_BTN = '🔍 Корзина'
CLEAR_CART_BTN = '⛔ Очистить корзину'
CART_CONTENTS_BTN = '🔍 Содержимое'
SEND_ORDER_BTN = '🚀 Сделать заказ'
CHOOSE_SIZE = 'Выберите размер пиццы 👇'
PIZZA_SIZE_SMALL = '33см'
PIZZA_SIZE_BIG = '40см'
CART_IS_FULL = '⛔ Извините, ваша корзина переполнена'
#OPERATOR
OPERATOR_COMMUNICATION_BTN = '💬 Оператор'
START_OPERATOR_CHAT_BTN = '💬 Чат с оператором'
GET_OPERATOR_PHONE_BTN = '📞 Узнать номер'

#----Carousel-Buttons----#
ADD_TO_CART_BTN = 'Добавить в корзину'
GET_COMPOSITION_BTN = 'Состав'